TD_Python.org
#+options: toc:nil
#+latex_header: \hypersetup{colorlinks=true,linkcolor=black}
#+AUTHOR: Romain PASTORELLI
#+TITLE: Exercices tutorat - Python
#+DATE: 20/09/2023

* Exercice 1 - Bonjour bonjour !
- Écrire un programme qui demande le nom de l'utilisateur et affiche "Bonjour /name/ !" (en remplaçant /name/ par son nom).
- Écrire une fonction qui affiche /n/ fois la phrase précédente avec /n/, un nombre entré par l'utilisateur.
- Écrire une fonction qui produit un affichage de cette forme (en remplaçant "Robert" par le nom de l'utilisateur) :
#+BEGIN_SRC python
  *obert
  R*bert
  Ro*ert
  Rob*rt
  Robe*t
  Rober*
#+END_SRC
- Écrire une fonction ~verlan()~ qui prend une chaîne de caractère (string) en entrée et la renvoie à l'envers : ~"string"~ $\implies$ ~"gnirts"~.
- Écrire une fonction qui demande la date de naissance de l'utilisateur et qui produit un affichage de cette forme :
  
  INPUT : 31/01/2003
  
  OUTPUT :
  
#+BEGIN_SRC python
  Jour : 31
  Mois : Janvier
  Année : 2003
  C'est l'année de vos 20 ans.
#+END_SRC
