TD_Python.tex
% Created 2023-09-21 Thu 15:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\hypersetup{colorlinks=true,linkcolor=black}
\author{Romain PASTORELLI}
\date{20/09/2023}
\title{Exercices tutorat - Python}
\hypersetup{
 pdfauthor={Romain PASTORELLI},
 pdftitle={Exercices tutorat - Python},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Exercice 1 - Bonjour bonjour !}
\label{sec:orga74a690}
\begin{itemize}
\item Écrire un programme qui demande le nom de l'utilisateur et affiche "Bonjour \emph{name} !" (en remplaçant \emph{name} par son nom).
\item Écrire une fonction qui affiche \emph{n} fois la phrase précédente avec \emph{n}, un nombre entré par l'utilisateur.
\item Écrire une fonction qui produit un affichage de cette forme (en remplaçant "Robert" par le nom de l'utilisateur) :
\end{itemize}
\begin{verbatim}
*obert
R*bert
Ro*ert
Rob*rt
Robe*t
Rober*
\end{verbatim}
\begin{itemize}
\item Écrire une fonction \texttt{verlan()} qui prend une chaîne de caractère (string) en entrée et la renvoie à l'envers : \texttt{"string"} \(\implies\) \texttt{"gnirts"}.
\item Écrire une fonction qui demande la date de naissance de l'utilisateur et qui produit un affichage de cette forme :

INPUT : 31/01/2003

OUTPUT :
\end{itemize}

\begin{verbatim}
Jour : 31
Mois : Janvier
Année : 2003
C'est l'année de vos 20 ans.
\end{verbatim}
\end{document}